AboutUs/app/controllers/images_controller.rb

  def approve
    @image = Image.find(params[:id])
    @image.update(:status_id => 1)
---
UPDATE `images` SET `updated_at` = '2018-07-10 20:05:18' WHERE `images`.`id` = 8