AboutUs/app/controllers/images_controller.rb


      # if specific category selected check that query (q) and category id exists
    elsif params[:q][:category_id].present?
      @user_cat_name = Category.find(@user_cat_id).name unless params[:q].nil?
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1