AboutUs/app/controllers/images_controller.rb

SELECT `images`.* FROM `images`
SELECT DISTINCT `images`.* FROM `images` WHERE `images`.`category_id` LIKE 0
---
  def index

    @images = Image.all

    #Ransack gem's  Paul Ancajima updated 7/17/18
    @q = Image.ransack(params[:q]) #.each {|k, v| [k, v.strip!]}) #Strips trailing spaces
    @images = @q.result(distinct: true).includes(:category) #Advance search

SELECT `images`.* FROM `images`
---
  def result
    @images = Image.all

INSERT INTO `images` (`is_approved`, `image_title`, `category_id`, `licensing`, `date`, `description`, `file_type`, `location`, `created_at`, `updated_at`) VALUES (FALSE, '', 1, '', '2018-07-10', '', '', '', '2018-07-10 20:05:18', '2018-07-10 20:05:18')
---
  def create
    @image = Image.new(image_params)

    respond_to do |format|

      if @image.save

UPDATE `images` SET `category_id` = 2, `updated_at` = '2018-07-10 06:24:23' WHERE `images`.`id` = 6
---
  def update
    respond_to do |format|
      if @image.update(image_params)

DELETE FROM `images` WHERE `images`.`id` = 1
---
  def destroy
    @image.destroy

SELECT  `images`.* FROM `images` WHERE `images`.`id` = 2 LIMIT 1
---
  def set_image
    @image = Image.find(params[:id])