AboutUs/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`user_id`, `is_admin`, `cart_id`, `album_list`, `friend_list`, `email`, `password`, `first_name`, `last_name`, `created_at`, `updated_at`) VALUES ('paul', TRUE, 1, 1, 2, 'paulancajima@yahoo.com', 'password', 'Paul', 'Ancajima', '2018-07-07 22:48:50', '2018-07-07 22:48:50')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `updated_at` = '2018-07-07 22:38:10' WHERE `users`.`id` = 11