AboutUs/app/views/images/_form.html.erb

    <%= form.label :category %>
    <%= form.collection_select(:category_id, Category.all, :id, :name, { :prompt => 'Select a Category', :selected => @image.category_id }, { class: 'form-control' }) %>
---
SELECT `categories`.* FROM `categories`