AboutUs/app/views/images/_form.html.erb

    <%= form.label :tag %>
    <%= form.collection_select(:tag_id, Tag.all, :id, :name, { :prompt => 'Select a Tag', :selected => @image.tag_id }, { class: 'form-control' }) %>
---
SELECT `tags`.* FROM `tags`