AboutUs/app/views/images/index.html.erb

SELECT `images`.* FROM `images`
---
    favorites!</p>
  <% @home = Image.all %>